def gen_null_one(idx, vector):
    if idx >= len(vector):          # дъно на рекурсията
        print(*vector, sep='')      # принираме получената комбинация и се връщаме на предходната клетка(назад по стека на рекурсията)
        return

    for num in range(2):               # 2, защото генерираме на всяка итерация 0 или 1 числото
        vector[idx] = num              # за клетката на конктрения индекс(idx) на масива(vector) искаме да поставиш 0 или 1
        gen_null_one(idx + 1, vector)  # действието за попълване се повтаря за следващата клетка в масива === рекурсия


n = int(input())
vector = [0] * n    # генериране на масив с фиксиран размер

gen_null_one(0, vector)   # 0, защото започваме да попълваме масиви от най-ляво (от първата клетка към последната)